In [1]:
import pandas as pd

In [3]:
list1 = [1,2,3,4,5]
list2 = ['a', 'b', 'c', 'd', 'e']
list3 = ['z','y','x','w','v']
list4 = ['Allie','Bob', 'Calvin', 'Doug', 'Ellie']

In [6]:
new_df = pd.concat([pd.Series(list1), pd.Series(list2), pd.Series(list3), pd.Series(list4)], axis=1)
new_df

   0  1  2       3
0  1  a  z   Allie
1  2  b  y     Bob
2  3  c  x  Calvin
3  4  d  w    Doug
4  5  e  v   Ellie

In [10]:
new_df.rename(columns={0:'Col_1',1:'Col_2', 2:'Col_3', 3:'Col_4'}, inplace=True)
new_df

   Col_1 Col_2 Col_3   Col_4
0      1     a     z   Allie
1      2     b     y     Bob
2      3     c     x  Calvin
3      4     d     w    Doug
4      5     e     v   Ellie